Repository: Porabuild/Poracode
Catalog: ios/App/App/Resources/RichChatMessageActions.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, pl, pt_br, ru, tr, uk, vi, zh_hans

# rich.message.copy
source: Copy Message
de: Nachricht kopieren
es: Copiar mensaje
fr: Copier le message
ja: メッセージをコピー
ko: 메시지 복사
pl: Kopiuj wiadomość
pt_br: Copiar mensagem
ru: Копировать сообщение
tr: İletiyi kopyala
uk: Копіювати повідомлення
vi: Sao chép tin nhắn
zh_hans: 复制消息

# rich.message.revert.action
source: Revert to This Checkpoint
de: Zu diesem Checkpoint zurückkehren
es: Volver a este punto de control
fr: Revenir à ce point de contrôle
ja: このチェックポイントに戻す
ko: 이 체크포인트로 되돌리기
pl: Przywróć ten punkt kontrolny
pt_br: Reverter para este ponto de controle
ru: Вернуться к этой контрольной точке
tr: Bu kontrol noktasına geri dön
uk: Повернутися до цієї контрольної точки
vi: Quay lại điểm kiểm tra này
zh_hans: 还原到此检查点

# rich.message.revert.title
source: Revert to checkpoint?
de: Zum Checkpoint zurückkehren?
es: ¿Volver al punto de control?
fr: Revenir au point de contrôle ?
ja: チェックポイントに戻しますか？
ko: 체크포인트로 되돌릴까요?
pl: Przywrócić punkt kontrolny?
pt_br: Reverter para o ponto de controle?
ru: Вернуться к контрольной точке?
tr: Kontrol noktasına geri dönülsün mü?
uk: Повернутися до контрольної точки?
vi: Quay lại điểm kiểm tra?
zh_hans: 还原到检查点？

# rich.message.revert.message
source: This removes later messages and restores files when a checkpoint snapshot is available.
de: Dadurch werden spätere Nachrichten entfernt und Dateien wiederhergestellt, wenn ein Checkpoint-Snapshot verfügbar ist.
es: Esto elimina los mensajes posteriores y restaura los archivos cuando hay una instantánea del punto de control disponible.
fr: Cette action supprime les messages suivants et restaure les fichiers lorsqu’un instantané de point de contrôle est disponible.
ja: 後続のメッセージを削除し、チェックポイントのスナップショットがある場合はファイルを復元します。
ko: 이후 메시지를 제거하고 체크포인트 스냅샷이 있으면 파일을 복원합니다.
pl: Spowoduje to usunięcie późniejszych wiadomości i przywrócenie plików, jeśli jest dostępna migawka punktu kontrolnego.
pt_br: Isso remove as mensagens posteriores e restaura os arquivos quando há um snapshot do ponto de controle disponível.
ru: Последующие сообщения будут удалены, а файлы восстановлены, если доступен снимок контрольной точки.
tr: Bu işlem sonraki iletileri kaldırır ve bir kontrol noktası anlık görüntüsü varsa dosyaları geri yükler.
uk: Наступні повідомлення буде видалено, а файли відновлено, якщо доступний знімок контрольної точки.
vi: Thao tác này xóa các tin nhắn sau đó và khôi phục tệp khi có ảnh chụp điểm kiểm tra.
zh_hans: 这会删除后续消息，并在有检查点快照时恢复文件。

# rich.message.revert.noFiles
source: No file checkpoint is stored for this message.
de: Für diese Nachricht ist kein Datei-Checkpoint gespeichert.
es: No hay un punto de control de archivos guardado para este mensaje.
fr: Aucun point de contrôle de fichiers n’est enregistré pour ce message.
ja: このメッセージのファイルチェックポイントは保存されていません。
ko: 이 메시지에 저장된 파일 체크포인트가 없습니다.
pl: Dla tej wiadomości nie zapisano punktu kontrolnego plików.
pt_br: Nenhum ponto de controle de arquivos foi salvo para esta mensagem.
ru: Для этого сообщения нет сохранённой контрольной точки файлов.
tr: Bu ileti için kayıtlı bir dosya kontrol noktası yok.
uk: Для цього повідомлення немає збереженої контрольної точки файлів.
vi: Không có điểm kiểm tra tệp nào được lưu cho tin nhắn này.
zh_hans: 未为此消息保存文件检查点。

# rich.message.revert.shared.one
source: Another chat uses this same tree. File restore could overwrite that chat's changes.
de: Ein anderer Chat verwendet denselben Baum. Die Dateiwiederherstellung könnte dessen Änderungen überschreiben.
es: Otro chat usa este mismo árbol. Restaurar archivos podría sobrescribir sus cambios.
fr: Un autre chat utilise la même arborescence. La restauration pourrait écraser ses modifications.
ja: 別のチャットが同じツリーを使用しています。ファイルの復元によって、そのチャットの変更が上書きされる可能性があります。
ko: 다른 채팅이 같은 트리를 사용합니다. 파일 복원으로 해당 채팅의 변경 사항을 덮어쓸 수 있습니다.
pl: Inny czat używa tego samego drzewa. Przywrócenie plików może nadpisać jego zmiany.
pt_br: Outro chat usa a mesma árvore. A restauração pode sobrescrever as alterações desse chat.
ru: Другой чат использует то же дерево. Восстановление файлов может перезаписать его изменения.
tr: Başka bir sohbet aynı ağacı kullanıyor. Dosya geri yükleme o sohbetin değişikliklerinin üzerine yazabilir.
uk: Інший чат використовує те саме дерево. Відновлення файлів може перезаписати його зміни.
vi: Một cuộc trò chuyện khác dùng cùng cây này. Việc khôi phục tệp có thể ghi đè thay đổi của cuộc trò chuyện đó.
zh_hans: 另一个聊天正在使用同一工作树。恢复文件可能会覆盖该聊天的更改。

# rich.message.revert.shared.many
source: %lld other chats use this same tree. File restore could overwrite their changes.
de: %lld weitere Chats verwenden denselben Baum. Die Dateiwiederherstellung könnte deren Änderungen überschreiben.
es: %lld chats más usan este mismo árbol. Restaurar archivos podría sobrescribir sus cambios.
fr: %lld autres chats utilisent la même arborescence. La restauration pourrait écraser leurs modifications.
ja: ほかに %lld 件のチャットが同じツリーを使用しています。ファイルの復元によって変更が上書きされる可能性があります。
ko: 다른 채팅 %lld개가 같은 트리를 사용합니다. 파일 복원으로 변경 사항을 덮어쓸 수 있습니다.
pl: %lld innych czatów używa tego samego drzewa. Przywrócenie plików może nadpisać ich zmiany.
pt_br: %lld outros chats usam a mesma árvore. A restauração pode sobrescrever as alterações deles.
ru: Ещё %lld чатов используют то же дерево. Восстановление файлов может перезаписать их изменения.
tr: %lld başka sohbet aynı ağacı kullanıyor. Dosya geri yükleme değişikliklerinin üzerine yazabilir.
uk: Ще %lld чатів використовують те саме дерево. Відновлення файлів може перезаписати їхні зміни.
vi: %lld cuộc trò chuyện khác dùng cùng cây này. Việc khôi phục tệp có thể ghi đè thay đổi của họ.
zh_hans: 另有 %lld 个聊天正在使用同一工作树。恢复文件可能会覆盖它们的更改。

# rich.message.revert.confirm
source: Revert
de: Zurücksetzen
es: Revertir
fr: Rétablir
ja: 元に戻す
ko: 되돌리기
pl: Przywróć
pt_br: Reverter
ru: Вернуть
tr: Geri döndür
uk: Повернути
vi: Hoàn nguyên
zh_hans: 还原

# rich.image.copy
source: Copy Image
de: Bild kopieren
es: Copiar imagen
fr: Copier l’image
ja: 画像をコピー
ko: 이미지 복사
pl: Kopiuj obraz
pt_br: Copiar imagem
ru: Копировать изображение
tr: Görseli kopyala
uk: Копіювати зображення
vi: Sao chép hình ảnh
zh_hans: 复制图像

# rich.image.share
source: Share Image
de: Bild teilen
es: Compartir imagen
fr: Partager l’image
ja: 画像を共有
ko: 이미지 공유
pl: Udostępnij obraz
pt_br: Compartilhar imagem
ru: Поделиться изображением
tr: Görseli paylaş
uk: Поділитися зображенням
vi: Chia sẻ hình ảnh
zh_hans: 共享图像

# rich.image.preview
source: Image Preview
de: Bildvorschau
es: Vista previa de la imagen
fr: Aperçu de l’image
ja: 画像プレビュー
ko: 이미지 미리보기
pl: Podgląd obrazu
pt_br: Prévia da imagem
ru: Предпросмотр изображения
tr: Görsel önizleme
uk: Попередній перегляд зображення
vi: Bản xem trước hình ảnh
zh_hans: 图像预览

# rich.image.preview.open
source: Open Image Preview
de: Bildvorschau öffnen
es: Abrir vista previa de la imagen
fr: Ouvrir l’aperçu de l’image
ja: 画像プレビューを開く
ko: 이미지 미리보기 열기
pl: Otwórz podgląd obrazu
pt_br: Abrir prévia da imagem
ru: Открыть предпросмотр изображения
tr: Görsel önizlemesini aç
uk: Відкрити попередній перегляд зображення
vi: Mở bản xem trước hình ảnh
zh_hans: 打开图像预览

# rich.image.preview.close
source: Close Image Preview
de: Bildvorschau schließen
es: Cerrar vista previa de la imagen
fr: Fermer l’aperçu de l’image
ja: 画像プレビューを閉じる
ko: 이미지 미리보기 닫기
pl: Zamknij podgląd obrazu
pt_br: Fechar prévia da imagem
ru: Закрыть предпросмотр изображения
tr: Görsel önizlemesini kapat
uk: Закрити попередній перегляд зображення
vi: Đóng bản xem trước hình ảnh
zh_hans: 关闭图像预览

# rich.errors
source: Errors
de: Fehler
es: Errores
fr: Erreurs
ja: エラー
ko: 오류
pl: Błędy
pt_br: Erros
ru: Ошибки
tr: Hatalar
uk: Помилки
vi: Lỗi
zh_hans: 错误

# rich.turn.workedFor
source: Worked for %@
de: %@ gearbeitet
es: Trabajó durante %@
fr: A travaillé pendant %@
ja: %@ 作業しました
ko: %@ 동안 작업함
pl: Czas pracy: %@
pt_br: Trabalhou por %@
ru: Работал %@
tr: %@ boyunca çalıştı
uk: Працював %@
vi: Đã làm việc trong %@
zh_hans: 工作了 %@

# rich.plan
source: Plan
ja: プラン
ko: 계획
pt_br: Plano
ru: План
uk: План
vi: Kế hoạch
zh_hans: 计划
